reports/mysql-coupon-loadtest/runs/diag2-n100-500rps-001/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/coupon-arrival-rate.js
        output: -

     scenarios: (100.00%) 1 scenario, 6000 max VUs, 40s max duration (incl. graceful stop):
              * unique_member_first_request: 500.00 iterations/s for 10s (maxVUs: 3000-6000, gracefulStop: 30s)


running (00.5s), 0090/3000 VUs, 141 complete and 0 interrupted iterations
unique_member_first_request   [   5% ] 0090/3000 VUs  00.5s/10s  500.00 iters/s

running (01.5s), 0113/3000 VUs, 619 complete and 0 interrupted iterations
unique_member_first_request   [  15% ] 0113/3000 VUs  01.5s/10s  500.00 iters/s

running (02.5s), 0218/3000 VUs, 1015 complete and 0 interrupted iterations
unique_member_first_request   [  25% ] 0218/3000 VUs  02.5s/10s  500.00 iters/s

running (03.5s), 0016/3000 VUs, 1717 complete and 0 interrupted iterations
unique_member_first_request   [  35% ] 0016/3000 VUs  03.5s/10s  500.00 iters/s

running (04.5s), 0095/3000 VUs, 2152 complete and 0 interrupted iterations
unique_member_first_request   [  45% ] 0095/3000 VUs  04.5s/10s  500.00 iters/s

running (05.5s), 0052/3000 VUs, 2680 complete and 0 interrupted iterations
unique_member_first_request   [  55% ] 0052/3000 VUs  05.5s/10s  500.00 iters/s

running (06.5s), 0014/3000 VUs, 3220 complete and 0 interrupted iterations
unique_member_first_request   [  65% ] 0014/3000 VUs  06.5s/10s  500.00 iters/s

running (07.5s), 0407/3000 VUs, 3328 complete and 0 interrupted iterations
unique_member_first_request   [  75% ] 0407/3000 VUs  07.5s/10s  500.00 iters/s

running (08.5s), 0642/3000 VUs, 3590 complete and 0 interrupted iterations
unique_member_first_request   [  85% ] 0642/3000 VUs  08.5s/10s  500.00 iters/s

running (09.5s), 0675/3000 VUs, 4058 complete and 0 interrupted iterations
unique_member_first_request   [  95% ] 0675/3000 VUs  09.5s/10s  500.00 iters/s

running (10.5s), 0220/3000 VUs, 4782 complete and 0 interrupted iterations
unique_member_first_request ↓ [ 100% ] 0685/3000 VUs  10s  500.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 5002   469.140987/s
    checks_succeeded...: 99.96% 5000 out of 5002
    checks_failed......: 0.03%  2 out of 5002

    ✗ business response or no server error
      ↳  99% — ✓ 5000 / ✗ 2

    CUSTOM
    coupon_issue_business_response_under_2s...: 96.08% 4806 out of 5002
    coupon_issue_issued.......................: 5000   468.953405/s

    HTTP
    http_req_duration.........................: avg=527.12ms min=0s     med=270.3ms  max=3.43s p(90)=1.36s p(95)=1.56s p(99)=2.16s
      { expected_response:true }..............: avg=527.33ms min=3.65ms med=270.45ms max=3.43s p(90)=1.36s p(95)=1.56s p(99)=2.16s
    http_req_failed...........................: 0.03%  2 out of 5002
    http_reqs.................................: 5002   469.140987/s

    EXECUTION
    iteration_duration........................: avg=534.41ms min=4.66ms med=280.83ms max=3.43s p(90)=1.36s p(95)=1.56s p(99)=2.18s
    iterations................................: 5002   469.140987/s
    vus.......................................: 220    min=14           max=675 
    vus_max...................................: 3000   min=3000         max=3000

    NETWORK
    data_received.............................: 1.2 MB 111 kB/s
    data_sent.................................: 1.6 MB 148 kB/s



running (10.7s), 0000/3000 VUs, 5002 complete and 0 interrupted iterations
unique_member_first_request ✓ [ 100% ] 0000/3000 VUs  10s  500.00 iters/s